// Методы Object, дескрипторы
// Деструктуризация, spread, rest, структуризация в ОБ

/////////////////////////////////////////////////////////
//                       RegExp                       //
///////////////////////////////////////////////////////
// 1. Регулярные выражения - средство поиска и замены в строках. Интегрированы в методы строк. Реализованы отдельным ОБ RegExp. 
// Состоит из шаблона и необязательных флагов. 

// 2 способа создания, 2-й - более распространенный:
regexp = new RegExp("шаблон", "флаги");

regexp = /шаблон/; // без флагов 
regexp = /шаблон/gmi; // с флагами gmi
// слэши /.../ - показывают JS, что это - регулярное выражение.

// Флаги:
// 1. i - поиск без учета регистра (A === a)
// 2. g - поиск всех слвпадений, без него - только первое совпадение
// 3. m - многострочный режим
// 4. s - режим "dotalL", при котором "." может соответствовать символу перевода строки
// 5. u - включает полную поддержку unicode 
// 6. y - режим поиска на конкретной позиции текста
// 7. d - рез-т регулярного выражения перемещается в массив с доп. информацией

// Примеры использования:
// 1. Поиск - str.match(regesp || string) имеет 3 режима работы:
//    1.1 если есть флаг g, то возвращает массив всех совпадений 
      let str = "Любо, братцы, любо!"
      str.match(/любо/gi)
//    1.2 если нет флага g, то возвращает массив первого совпадения
//    1.3 если совпадений нет, то возвращает null
// 2. Замена - str.replace(regesp || string, replacement) - replacement (замена)
      'We will, we will'.replace(/we/i, 'I')
// В строке замены replacement мы можем исп-ть спец. комбинацию символов для вставки фрагметов совпадения:
//    2.1. $& - вставляет всё найденное совпадение
//    2.2. $` - вставляет часть строки ДО совпадения
//    2.3. $' - вставляет часть строки после совпадения
//    2.4. $n - (n - одно-двухзначное число) вставляет содержимое n-ой скобочной группы регулярного выражения
//    2.5. $<name> - вставляет содержимое скобочной группы с именем name
//    2.6. $$ - вставляет символ $
'Люблю HTML'.replace(/HTML/, '$& и JavaScript')
// 3. Проверка - regexp.test(str)
let str = 'Я ЛюБЛю JS'
let regexp = /люблю/i
regexp.test(str)
// возвращает true, если есть хотя бы 1 совпадение



// Декораторы, паттерны (шаблоны) программирования
// Ассинхронность
// SetTimeout, SetInterval
// Import - Export
// Promise
// async await
  